n5/src/Documents/TimeEntry/TimeEntry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TimeEntry</name>
  <basedOn>Catalog.Projects</basedOn>
  <basedOn>Task.UserTask</basedOn>
  <basedOn>Document.InternalOrder</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.Event</basedOn>
  <registerRecords>AccumulationRegister.ProjectsCost</registerRecords>
  <registerRecords>AccumulationRegister.Work</registerRecords>
  <registerRecords>InformationRegister.TimeEntryRates</registerRecords>
  <attributes>
    <name>Appearance</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>BillableMinutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentOrder</name>
    <type>
      <types>DocumentRef.InternalOrder</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Event</name>
    <type>
      <types>DocumentRef.Event</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>Reminder</name>
    <type>
      <types>EnumRef.Reminder</types>
    </type>
  </attributes>
  <attributes>
    <name>ReminderDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Signature</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Signer</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tasks</name>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>600</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.InternalOrder</types>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Task</name>
      <type>
        <types>CatalogRef.Tasks</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeEnd</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeStart</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeType</name>
      <type>
        <types>EnumRef.Time</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/InformationRegisters/TimeEntryInvoices/TimeEntryInvoices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TimeEntryInvoices</name>
  <resources>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.ProjectsInvoice</types>
    </type>
  </resources>
  <resources>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>TimeEntry</name>
    <type>
      <types>DocumentRef.TimeEntry</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Documents/TimeEntry/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	checkTasks ( CheckedAttributes );
	checkWarehouse ( CheckedAttributes );
	
EndProcedure

Procedure checkTasks ( CheckedAttributes )
	
	obligatoryTasks = DF.Pick ( Project, "ObligatoryTasks" );
	if ( obligatoryTasks ) then
		CheckedAttributes.Add ( "Tasks.Task" );
	endif; 
	
EndProcedure 

Procedure checkWarehouse ( CheckedAttributes )
	
	if ( Items.Count () > 0 ) then
		CheckedAttributes.Add ( "Warehouse" );
	endif; 
	
EndProcedure

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( alreadyExists () ) then
		Cancel = true;
		return;
	endif; 
	if ( not checkTimesheetPeriod () ) then
		Cancel = true;
		return;
	endif; 
	removeReminder ();
	adjustTimeOfDate ();
	setReminderDate ();
	
EndProcedure

Function alreadyExists ()
	
	if ( timeEntryFound () ) then
		Output.TimeEntryAlreadyExists ( new Structure ( "Date, Customer", Format ( Date, "DLF=D" ), Customer ) );
		return true;
	endif; 
	return false;
	
EndFunction

Function timeEntryFound ()
	
	s = "
	|select top 1 1
	|from Document.TimeEntry as TimeEntries
	|where TimeEntries.Date between &DateStart and &DateEnd
	|and TimeEntries.Project = &Project
	|and TimeEntries.Employee = &Employee
	|and TimeEntries.Ref <> &CurrentTimeEntry
	|and not TimeEntries.DeletionMark
	|";
	q = new Query ( s );
	q.SetParameter ( "DateStart", BegOfDay ( Date ) );
	q.SetParameter ( "DateEnd", EndOfDay ( Date ) );
	q.SetParameter ( "Project", Project );
	q.SetParameter ( "Employee", Employee );
	q.SetParameter ( "CurrentTimeEntry", Ref );
	return not q.Execute ().IsEmpty ();
	
EndFunction

Function checkTimesheetPeriod ()
	
	if ( Employee.IsEmpty () ) then
		return true;
	endif; 
	if ( AdditionalProperties.Property ( "ChangedFromTimesheet" ) ) then
		return true;
	endif; 
	existedTimesheet = Documents.TimeEntry.GetTimesheetByEmployee ( Date, Employee );
	if ( existedTimesheet <> undefined ) then
		Output.TimesheetComprisesTimeEntry ( new Structure ( "Employee, Timesheet", Employee, existedTimesheet ), , existedTimesheet );
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure removeReminder ()
	
	if ( IsNew () ) then
		return;
	endif; 
	Jobs.Remove ( Ref );
	
EndProcedure 

Procedure adjustTimeOfDate ()
	
	startTime = Date ( 3999, 12, 31 );
	for each row in Tasks do
		startTime = Min ( startTime, row.TimeStart );
	enddo; 
	if ( startTime <> Date ( 3999, 12, 31 ) ) then
		Date = BegOfDay ( Date ) + ( startTime - BegOfDay ( startTime ) );
	endif; 
	
EndProcedure 

Procedure setReminderDate ()
	
	if ( Reminder = Enums.Reminder.None ) then
		return;
	endif; 
	ReminderDate = Enums.Reminder.GetDate ( Date, Reminder );
	
EndProcedure 

Procedure Posting ( Cancel, PostingMode )
	
	env = Posting.GetParams ( Ref, RegisterRecords );
	if ( not Documents.TimeEntry.Post ( env ) ) then
		Cancel = true;
		return;
	endif;
	if ( Reminder <> Enums.Reminder.None
		and CurrentSessionDate () < ReminderDate ) then
		TimeReminder.Write ( ThisObject );
	endif; 
	
EndProcedure

Procedure UndoPosting ( Cancel )
	
	deleteTimeEntriesInvoicing ();
	
EndProcedure

Procedure deleteTimeEntriesInvoicing ()
	
	record = InformationRegisters.TimeEntryInvoices.CreateRecordManager ();
	record.TimeEntry = Ref;
	record.Delete ();
	
EndProcedure 

#endif
